### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_api.send_api_v1 must be replaced
-/+ resource "azurerm_api_management_api" "send_api_v1" {
      ~ api_management_name   = "io-p-itn-apim-01" -> "io-p-itn-platform-api-gateway-apim-01" # forces replacement
      ~ api_type              = "http" -> (known after apply)
      ~ id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-itn-send-aar-api-01;rev=1" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
        name                  = "io-p-itn-send-aar-api-01"
      ~ path                  = "api/v1/send/aar" -> "api/com/v1/send/aar"
      ~ service_url           = "https://api-app.io.pagopa.it/api/v1/send/aar" -> (known after apply)
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (9 unchanged attributes hidden)

      ~ import {
          ~ content_value  = "https://raw.githubusercontent.com/pagopa/io-messages/2a453400559b42a4949db4a9b4c0481226a4c11e/apps/send-func/openapi/aar-notification.yaml" -> "https://raw.githubusercontent.com/pagopa/io-messages/2b0d3d226b95f731c4a6fdf58daff2e6dfcb4ef0/apps/send-func/openapi/aar-notification.yaml"
            # (1 unchanged attribute hidden)
        }

      ~ subscription_key_parameter_names (known after apply)
      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }
    }

  # module.apim.azurerm_api_management_api_policy.send_aar_api_v1_policy must be replaced
-/+ resource "azurerm_api_management_api_policy" "send_aar_api_v1_policy" {
      ~ api_management_name = "io-p-itn-apim-01" -> "io-p-itn-platform-api-gateway-apim-01" # forces replacement
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-itn-send-aar-api-01" -> (known after apply)
      ~ xml_content         = <<-EOT
            <policies>
            	<inbound>
            		<include-fragment fragment-id="io-com-app-session-fragment" />
            		<base />
            		<set-backend-service base-url="https://io-p-itn-com-send-func-01.azurewebsites.net/api/v1/send/aar" />
            	</inbound>
            	<outbound>
            		<base />
            	</outbound>
            	<backend>
            		<base />
            	</backend>
            	<on-error>
            		<base />
            	</on-error>
            </policies>
        EOT -> (known after apply)
      ~ xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/2a453400559b42a4949db4a9b4c0481226a4c11e/infra/resources/_modules/apim/api/send/policy.xml" -> "https://raw.githubusercontent.com/pagopa/io-messages/2b0d3d226b95f731c4a6fdf58daff2e6dfcb4ef0/infra/resources/_modules/apim/api/send/policy.xml"
        # (2 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_policy_fragment.auth must be replaced
-/+ resource "azurerm_api_management_policy_fragment" "auth" {
      ~ api_management_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01" # forces replacement
      ~ id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/policyFragments/io-com-app-session-fragment" -> (known after apply)
        name              = "io-com-app-session-fragment"
      ~ value             = <<-EOT
          - <fragment>
          - 	<!-- Extract the token from the Authorization Header -->
          - 	<set-variable name="token" value="@{
          + <fragment>
          + 	<!-- Extract the token from the Authorization Header -->
          +   <set-variable name="token" value="@{
                string[] values;
                return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";
          -   }" />
          - 	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          - 	<choose>
          - 		<when condition="@(
          +   }" />
          +   <!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          +   <choose>
          +     <when condition="@(
                  string.IsNullOrEmpty((string)context.Variables["token"]) ||
                  !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||
                  string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))
          -     )">
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response>
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 	</choose>
          - 	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
          - 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          - 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          - 		<set-method>GET</set-method>
          - 		<set-header name="Content-Type" exists-action="override">
          - 			<value>application/json</value>
          - 		</set-header>
          - 		<set-header name="Authorization" exists-action="override">
          - 			<value>@(((string)context.Variables["token"]))</value>
          - 		</set-header>
          - 	</send-request>
          - 	<choose>
          - 		<!-- If 200 return set the x-user header as the base64 of the response -->
          - 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)">
          - 			<!-- Parse the introspectionResponse as a string -->
          - 			<set-variable name="userData" value="@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())" />
          - 			<!-- Remove the Authorization Header -->
          - 			<set-header name="Authorization" exists-action="delete" />
          - 			<!-- Set the x-user header with the user data -->
          - 			<set-header name="x-user" exists-action="override">
          +     )">
          +       <set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          +       </set-header>
          +       <return-response>
          +         <set-status code="401" reason="Unauthorized" />
          +         <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +       </return-response>
          +   </when>
          +   </choose>
          +   <!-- Call the session manager, pasing the bearer token, to get the user identity -->
          + 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          + 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          + 		<set-method>GET</set-method>
          + 		<set-header name="Content-Type" exists-action="override">
          +       <value>application/json</value>
          + 		</set-header>
          + 		<set-header name="Authorization" exists-action="override">
          +       <value>@(((string)context.Variables["token"]))</value>
          + 		</set-header>
          + 	</send-request>
          + 	<choose>
          +     <!-- If 200 return set the x-user header as the base64 of the response -->
          + 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)">
          + 			<!-- Parse the introspectionResponse as a string -->
          + 			<set-variable name="userData" value="@(((IResponse)context.Variables["introspectionResponse"]).Body.As&lt;string&gt;())" />
          + 			<!-- Remove the Authorization Header -->
          + 			<set-header name="Authorization" exists-action="delete" />
          + 			<!-- Set the x-user header with the user data -->
          + 			<set-header name="x-user" exists-action="override">
            				<value>@(
                      Convert.ToBase64String(
                          System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
                      )
          -         )</value>
          - 			</set-header>
          - 		</when>
          - 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)">
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</when>
          - 		<otherwise>
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="500" reason="Internal Server Error" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          - 		</otherwise>
          - 	</choose>
          +         )</value>
          + 			</set-header>
          + 		</when>
          + 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)">
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="401" reason="Unauthorized" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          + 			</return-response>
          + 		</when>
          + 		<otherwise>
          + 			<set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          + 			</set-header>
          + 			<return-response response-variable-name="introspectionErrorResponse">
          + 				<set-status code="500" reason="Internal Server Error" />
          +           <set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          +         </return-response>
          + 		</otherwise>
          + 	</choose>
            </fragment>
        EOT
        # (2 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_product.apim_itn_product_send_aar must be replaced
-/+ resource "azurerm_api_management_product" "apim_itn_product_send_aar" {
      ~ api_management_name   = "io-p-itn-apim-01" -> "io-p-itn-platform-api-gateway-apim-01" # forces replacement
      ~ id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/io-send-aar-api" -> (known after apply)
      - subscriptions_limit   = 0 -> null
        # (8 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_product_api.send_aar_api_v1_product_api must be replaced
-/+ resource "azurerm_api_management_product_api" "send_aar_api_v1_product_api" {
      ~ api_management_name = "io-p-itn-apim-01" -> "io-p-itn-platform-api-gateway-apim-01" # forces replacement
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/io-send-aar-api/apis/io-p-itn-send-aar-api-01" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_product_policy.apim_itn_product_send_policy must be replaced
-/+ resource "azurerm_api_management_product_policy" "apim_itn_product_send_policy" {
      ~ api_management_name = "io-p-itn-apim-01" -> "io-p-itn-platform-api-gateway-apim-01" # forces replacement
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/io-send-aar-api" -> (known after apply)
      ~ xml_content         = <<-EOT
            <policies>
            	<inbound>
            		<base />
            		<!-- PRIVATE PRODUCT -->
            		<ip-filter action="allow">
            			<address-range from="10.0.0.0" to="10.255.255.255" />
            			<address-range from="172.16.2.0" to="172.16.2.255" />
            		</ip-filter>
            	</inbound>
            	<backend>
            		<base />
            	</backend>
            	<outbound>
            		<base />
            	</outbound>
            	<on-error>
            		<base />
            	</on-error>
            </policies>
        EOT -> (known after apply)
      ~ xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/2a453400559b42a4949db4a9b4c0481226a4c11e/infra/resources/_modules/apim/product/policy.xml" -> "https://raw.githubusercontent.com/pagopa/io-messages/2b0d3d226b95f731c4a6fdf58daff2e6dfcb4ef0/infra/resources/_modules/apim/product/policy.xml"
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```

</details>
